TOIR/src/Documents/ЗаданиеНаРаботы/ЗаданиеНаРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаРаботы</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОбслуживания</name>
    <type>
      <types>CatalogRef.ОбъектыОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехнологическаяОперация</name>
    <type>
      <types>CatalogRef.ТехнологическиеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоРабот</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TOIR/src/Catalogs/ТехнологическиеОперации/ТехнологическиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТехнологическиеОперации</name>
  <owners>Catalog.ОбъектыОбслуживания</owners>
  <tabularSections>
    <name>Работы</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

TOIR/src/Documents/ЗаданиеНаРаботы/Forms/DocumentForm/Module.bsl
&AtClient
Procedure Заполнить(Command)
	ЗаполнитьAtServer();
EndProcedure

&AtServer
Procedure ЗаполнитьAtServer()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "SELECT
	|	ТехнологическиеОперацииРаботы.Описание КАК ОписаниеРабот
	|FROM
	|	Catalog.ТехнологическиеОперации.Работы AS ТехнологическиеОперацииРаботы
	|WHERE
	|	ТехнологическиеОперацииРаботы.Ref = &Ref";
	
	Запрос.УстановитьПараметр("Ref", Object.ТехнологическаяОперация);
	Результат = Запрос.Выполнить().Выгрузить();
	Object.Работы.Загрузить(Результат);
	//
	//
	// 
EndProcedure
